# specify a directory to install
cask_args appdir: '/Applications'

# CLI Tooling
brew 'tmux'
brew 'git'
brew 'tig'
brew 'jq'
brew 'tree'
brew 'wget'
brew 'eza'
brew 'openjdk'
brew 'awscli'
brew 'awscli-local'
brew 'aws-sam-cli'

# Development Runtimes
brew 'nvm'

# Database Tooling
brew 'postgresql@13'

# Browsers
cask 'google-chrome'
cask 'brave-browser'
cask 'microsoft-edge'
cask 'firefox'

# Comms
cask 'telegram'
cask 'whatsapp'

# OS Tooling
cask 'caffeine'
cask 'rectangle'
cask 'raycast'

# Development
cask 'iterm2'
cask 'docker'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'insomnia'

# Misc
cask 'spotify'
cask 'vlc'

